In [8]:
import pandas as ds
df=ds.read_csv("E:\data-2.csv")
print(df.to_string())

    s.no      name  age  gender        ph.no country passport lisence
0      1   sreekar   18    male   654*****55   india        x       r
1      2   pradeep   18    male   455677***6   italy        y       t
2      3   krishna   18    male   5678****67   japan        c       y
3      4    rajash   18    male   45678****6  chaina        v       u
4      5    venkat   18    male   3456****56  german        g       j
5      6    tharun   18    male     534*2159  canada        y       k
6      7  srinivas   47    male   654*****56  london        u       l
7      8    vijaya   45  female  34565***667   india        t       m
8      9    pranay   18    male   457*****56  chaina        g       n
9     10     phani   18    male   456*****45  france        h       o
10    11    pranav   18    male   345*****34   india        t       p
11    12    charan   18    male    453****45   italy        j       e
12    13     pandu   18    male   654*****57   japan        k       r
13    14   prabhas   18    male   234*****89  chaina        l       e
14    15      pspk   18    male   761*****34   india        m       f

In [13]:
import pandas as ds
df=ds.read_csv("E:\data-2.csv")
print(df.to_string())
df.aggregate({"age":min})

    s.no      name  age  gender        ph.no country passport lisence
0      1   sreekar   18    male   7869056789   india        x       r
1      2   pradeep   18    male  67585940487   italy        y       t
2      3   krishna   18    male  86698988858   japan        c       y
3      4    rajash   18    male  87578557555  chaina        v       u
4      5    venkat   18    male  76868687686  german        g       j
5      6    tharun   18    male  87686868989  canada        y       k
6      7  srinivas   47    male  76868687686  london        u       l
7      8    vijaya   45  female  76868687686   india        t       m
8      9    pranay   18    male  87686868989  chaina        g       n
9     10     phani   18    male  87578557555  france        h       o
10    11    pranav   18    male   7869056789   india        t       p
11    12    charan   18    male   7869056789   italy        j       e
12    13     pandu   18    male  76868687686   japan        k       r
13    14   prabhas   18    male  46474784747  chaina        l       e
14    15      pspk   18    male  84747747437   india        m       f

age    18
dtype: int64

In [15]:
import pandas as ds
df=ds.read_csv("E:\data-2.csv")
print(df.to_string())
df.aggregate({"age":['min','max']})

    s.no      name  age  gender        ph.no country passport lisence
0      1   sreekar   18    male   7869056789   india        x       r
1      2   pradeep   18    male  67585940487   italy        y       t
2      3   krishna   18    male  86698988858   japan        c       y
3      4    rajash   18    male  87578557555  chaina        v       u
4      5    venkat   18    male  76868687686  german        g       j
5      6    tharun   18    male  87686868989  canada        y       k
6      7  srinivas   47    male  76868687686  london        u       l
7      8    vijaya   45  female  76868687686   india        t       m
8      9    pranay   18    male  87686868989  chaina        g       n
9     10     phani   18    male  87578557555  france        h       o
10    11    pranav   18    male   7869056789   india        t       p
11    12    charan   18    male   7869056789   italy        j       e
12    13     pandu   18    male  76868687686   japan        k       r
13    14   prabhas   18    male  46474784747  chaina        l       e
14    15      pspk   18    male  84747747437   india        m       f

     age
min   18
max   47

In [40]:
import pandas as ds
df=ds.read_csv("E:\data-2.csv")
print(df.to_string())
df.aggregate({"age":['sum','min','max','average'],
            "ph.no":['sum','min','max','average']})

    s.no      name  age  gender        ph.no country passport lisence
0      1   sreekar   18    male   7869056789   india        x       r
1      2   pradeep   18    male  67585940487   italy        y       t
2      3   krishna   18    male  86698988858   japan        c       y
3      4    rajash   18    male  87578557555  chaina        v       u
4      5    venkat   18    male  76868687686  german        g       j
5      6    tharun   18    male  87686868989  canada        y       k
6      7  srinivas   47    male  76868687686  london        u       l
7      8    vijaya   45  female  76868687686   india        t       m
8      9    pranay   18    male  87686868989  chaina        g       n
9     10     phani   18    male  87578557555  france        h       o
10    11    pranav   18    male   7869056789   india        t       p
11    12    charan   18    male   7869056789   italy        j       e
12    13     pandu   18    male  76868687686   japan        k       r
13    14   prabhas   18    male  46474784747  chaina        l       e
14    15      pspk   18    male  84747747437   india        m       f

                age         ph.no
sum      326.000000  9.671202e+11
min       18.000000  7.869057e+09
max       47.000000  8.768687e+10
average   21.733333  6.447468e+10

In [38]:
import pandas as ds
df=ds.read_csv("E:\data-2.csv")
df.groupby('name')
print(df.groupby('name').groups)

{'charan': [11], 'krishna': [2], 'pandu': [12], 'phani': [9], 'prabhas': [13], 'pradeep': [1], 'pranav': [10], 'pranay': [8], 'pspk': [14], 'rajash': [3], 'sreekar': [0], 'srinivas': [6], 'tharun': [5], 'venkat': [4], 'vijaya': [7]}